{
    "morning": "Good morning :)",
    "daytime": "Good afternoon :)",
    "evening": "Good evening :)",
    "night": "Good night :)",
    "iam": "I'm Hitoshi",
    "wrongcmd": "Invalid command entered :( You can find the list of commands in Kanade or by writing the command 'help'",
    "whoami": "Hitoshi is my nickname). \nI am a Full-Stack developer, but with a bias towards the backend. I like to design clean and convenient APIs, work with databases and think through the architecture of services. \nIn the frontend I use Vue.js, and on the backend I prefer NestJS and FastAPI. I confidently use PostgreSQL, TypeORM and SQLAlchemy to build complex relationships between entities. \nI can work with LLM via Ollama and launched gguf model images downloaded from Hugging Face, used LangChain to implement RAG architecture, and also experimented with Fine-tuning models (however, this is far from my main direction, but just for fun). \nI also created telegram bots using aiogram and connected a database to them. I have experience in deploying projects, separately backend, frontend and database, and then connecting all this to each other. \nMain programming languages: TypeScript, JavaScript, Python. \nI strive to write code that is easy to maintain and scale. \nTyping 'projects' will show you a list of projects and the stack they used, or typing 'help' will list all the commands. You'll see more detailed information about the projects below.",
    "education": "At the moment I am a 2nd year student at Tyumen Industrial University (TIU) and I am studying at the Institute of Higher School of Digital Technologies in the direction of 'Applied Informatics'. \nI also took 3 courses on Stepik, 2 of which were on Python and helped me understand the basics of programming and taught algorithmic thinking, and 1 was on HTML and CSS, this course has already taught me the basics of website layout.",
    "projects": "ITrialto  :  Vue js, Nest js, postgres, TypeORM\nurfu_ddos_bot  :  aiogram, SQLAlchemy, posgres, Flask\nhitoshi.sh  :  Vue js",
    "contact": "GitHub  :  https://github.com/Hitoshi144 \nTelegram  :  @Hitoshi_0 \nMail  :  myshakin2018@mail.ru",
    "hobby": "This point is, of course, not so important, but it may help you better understand what kind of person I am.\nOne of my hobbies is playing the electric guitar. At the moment, I have been playing for 3 years. I started with an old acoustic guitar and a year later, with the help of a part-time job, I bought myself a new electric guitar. Although before I could not even imagine myself with a guitar in my hands, now I can not imagine my life without it.\nVideo and audio editing are also my hobbies. In particular, I even monetized video editing by fulfilling orders on a freelance exchange.\nPyrography (wood burning). Although it is a rather labor-intensive and painstaking hobby, I get real pleasure from slowly drawing a whole picture on wood. I have often been asked how I have enough patience, because I can do one job for several months, and the burning process itself is very slow, but I do not experience any discomfort ┐(￣∀￣)┌. I have been doing this for about 7 years and I do not plan to quit) \nWell, video games, watching anime and reading manga are not so much a hobby, but just a way to relax, but let them be mentioned too... \n \n*thanks for looking at this point*",
    "help": "whoami : basic information\neducation : education and courses\nprojects : short list of top projects\ncontact : how to contact\nhobby : activities outside the code\nclear : clear terminal",
    "kanade-phrase-1_1": "Hello! I'm Yoisaki Kanade from Project SEKAI. I'll be your guide",
    "kanade-phrase-1_2": "Ahem... This site is like an interactive business card. Here you'll find out who Hitoshi is, what he does, and what projects he creates with heart and attention to detail.",
    "kanade-phrase-1_3": "Well, shall we move on?",
    "kanade-phrase-1_4": "Yes, yes, I'm here! Is there something you're interested in?",
    "kanade-phrase-1_5": "If you want to move on, just scroll down. I'll be right here.",
    "kanade-phrase-1_6": "Sorry, this is a little ticklish...",
    "kanade-phrase-2_1": "It seems Hitoshi has decided to add some interactivity!",
    "kanade-phrase-2_2": "This is a terminal made without much fuss. You can use it to find out more information about Hitoshi.",
    "kanade-phrase-2_3": "To see the full list of commands, type 'help'",
    "kanade-phrase-2_4": "Is there anything else you'd like to know?",
    "kanade-phrase-2_5": "'whoami' - a command that will tell you who is behind this website",
    "kanade-phrase-2_6": "'Education' will tell you how Hitoshi honed his skills.",
    "kanade-phrase-2_7": "'projects' will display the main projects of Hitosi. You can find more details about them below.",
    "kanade-phrase-2_8": "'contact' will show you where you can contact Hitoshi.",
    "kanade-phrase-2_9": "'hobby' - shows what inspires Hitoshi outside of IDE",
    "kanade-phrase-2_10": "If there are too many letters, you can enter ‘clear’.",
    "kanade-phrase-2_11": "Not sure where to start? ‘help’ will display all commands.",
    "kanade-phrase-3_1": "Here they are! Hitosi's projects",
    "kanade-phrase-3_2": "Even though there aren't many, please take a look. He worked hard on them",
    "kanade-phrase-4_1": "That's all, I hope you enjoyed this little adventure.",
    "kanade-phrase-4_2": "Thank you for your atten..",
    "kanade-phrase-4_3": "꒰｡- ᴗ - ｡꒱ ᶻzᶻzᶻz﹒﹒",
    "itrialto-description": "This project is a platform where students can implement IT projects from university partners or from the university itself. Briefly what is implemented here: registration/authorization (With protection via JWT token), division of users by roles, system of teams, different exchanges and projects, interaction of teams and projects and chat system. You can learn more about the project by following the link on GitHub or watching the video.",
    "itrialto-link": "https://www.youtube.com/embed/kNvPWcEjRgw",
    "urfu_ddos-description": "Telegram bot created to help my friend. The purpose of the bot is to collect information about all applicants, filter and sort it, and at the end - display the current place in the competition lists. More detailed information about the bot's work is on GitHub :)",
    "urfu_ddos-link": "https://www.youtube.com/embed/fwm7STLAsew",
    "hitoshi.sh-description": "You are already in this project (⌒_⌒;). In it I emphasized on the beauty of the design, but the 2D model is the most interesting part of it. Originally this project was supposed to be written in React, but I didn't manage to connect Live2D there so that I could have full control over the model. Yes, I had to mess around in Vue JS too: I got it when I found some two minute video in CHINA (`ー´), but I ate a couple of ‘bowl of rice’ and it worked out. There was no point in making a video on this project, so I suggest you listen to a beautiful euphonium solo. The composition is called ‘Sound, euphonium!’ from the anime of the same name. Enjoy listening :)",
    "stepik-certificate-1": "/src/assets/stepik-certificate-1_en.png",
    "stepik-certificate-2": "/src/assets/stepik-certificate-2_en.png",
    "stepik-certificate-3": "/src/assets/stepik-certificate-3_en.png",
    "final-message": "Thank you for taking the time to visit my website ( ´ ▽ ` ) I hope it gave you an idea of who I am. Contact details are on the right, and some of my achievements are listed below."
}