{
    "morning": "Доброе утро :)",
    "daytime": "Добрый день :)",
    "evening": "Добрый вечер :)",
    "night": "Доброй ночи :)",
    "iam": "Я Хитоши",
    "wrongcmd": "Введена неверная команда :( Список команд можно узнать у Канаде или написав команду 'help'",
    "whoami": "Hitoshi - это мой псевдоним). \nЯ Full-Stack разработчик, но с уклоном в бэкенд. Мне нравится проектировать чистые и удобные API, работать с базами данных и продумывать архитектуру сервисов. \nВо фронтенде использую Vue.js, а на бэкенде предпочитаю NestJS и FastAPI. Уверенно использую PostgreSQL, TypeORM и SQLAlchemy для построения сложных связей между сущностями. \nУмею работать с LLM через Ollama и запускал gguf образы моделей, скачанные на Hugging Face, применял LangChain для реализации RAG-архитектуры, а также эксперементировал с Fine-tuning моделей (однако это далеко не моё основное направление, а лишь ради интереса). \nТакже создавал телеграм-ботов с использованием aiogram и подключал к ним базу данных. Есть опыт в деплое проектов, отдельно бэкенда, фронтенда и базы данных, а затем подключения всего этого дела друг к другу. \nОсновные языки программирования: TypeScript, JavaScript, Python. \nЯ стремлюсь писать код, который легко поддерживать и масштабировать. \nНаписав команду 'projects' вы увидите список проектов и стек, который в них использовался, или можете написать 'help' для списка всех команд. Более подробную информацию о проектах вы увидите ниже.",
    "education": "На данный момент я являюсь студентом 2 курса в Тюменском Индустриальном Университете (ТИУ) и обучаюсь в институте Высшей Школы Цифровых Технологий по направлению 'Прикладная информатика'. \nТакже прошёл 3 курса на Stepik, 2 из которых были по Python и помогли мне понять основы программирования и научили алгоритмическому мышлению, а 1 был по HTML и CSS, этот курс уже научил меня основам вёрстки сайтов.",
    "projects": "ITrialto  :  Vue js, Nest js, postgres, TypeORM\nurfu_ddos_bot  :  aiogram, SQLAlchemy, posgres, Flask\nhitoshi.sh  :  Vue js",
    "contact": "GitHub  :  https://github.com/Hitoshi144 \nTelegram  :  @Hitoshi_0 \nMail  :  myshakin2018@mail.ru",
    "hobby": "Данный пункт, конечно, не такой важный, но он возможно поможет лучше понять какой я человек.\nОдно из моих увлечений - игра на электрогитаре. На данный момент я играю уже 3 года. Начинал со старой акустической гитары и спустя год, с помощью подработки, купил себе новую электрогитару. Хотя раньше я даже и представить себя не мог с гитарой в руках, сейчас я не представляю свою жизнь без неё.\nВидео и аудио монтаж тоже являются моими хобби. В частности видеомонтаж я даже монетизировал, выполняя заказы на фриланс бирже.\nПирография (выжигание по дереву). Пусть и является  довольно-таки трудоёмким и кропотливым хобби, но я получаю настоящее наслаждение от медленного рисования целой картины на дереве.  Меня частно спрашивали, как мне хватает терпения, ведь одну работу я могу делать несколько месяцев, да и сам процесс выжигания очень медленный, но я не испытываю какого-либо дискомфорта ┐(￣∀￣)┌. Я занимаюсь этим уже около 7 лет и не собираюсь бросать)\nНу видеоигры, просмотр аниме и чтение манги скорее не хобби, а просто способ отдыха, но тоже пусть будут упомянуты...\n \n*спасибо что заглянули в данный пункт*",
    "help": "whoami : основная информация\neducation : учёба и курсы\nprojects : краткий список топ-проектов\ncontact : как связаться\nhobby : занятия вне кода\nclear : очистить терминал",
    "kanade-phrase-1_1": "Здравствуйте! Я Ёисаки Канаде из игры Project SEKAI. Буду вашей проводницей",
    "kanade-phrase-1_2": "Кхм... Этот сайт — как интерактивная визитка. Здесь вы узнаете, кто такой Хитоши, чем он занимается, и какие проекты создаёт с душой и вниманием к деталям.",
    "kanade-phrase-1_3": "Ну что, пойдём дальше?",
    "kanade-phrase-1_4": "Да-да, я тут! Что-то интересует?",
    "kanade-phrase-1_5": "Если хотите перейти дальше - просто пролистайте. Я буду рядом.",
    "kanade-phrase-1_6": "Извините, это немного щекотно..",
    "kanade-phrase-2_1": "Кажется Хитоши решил добавить немного интерактива!",
    "kanade-phrase-2_2": "Это терминал, сделанный на коленке. С его помощью вы можете узнать более подробную информацию о Хитоши.",
    "kanade-phrase-2_3": "Чтобы увидеть полный список команд, введите 'help'",
    "kanade-phrase-2_4": "Хотите узнать что-нибудь еще?",
    "kanade-phrase-2_5": "'whoami' - команда, которая расскажет, кто стоит за этим сайтом",
    "kanade-phrase-2_6": "'education' расскажет, как Хитоши прокачивал свои навыки",
    "kanade-phrase-2_7": "'projects' выведет главное - проекты Хитоши. Подробнее ознакомиться с ними можно ниже",
    "kanade-phrase-2_8": "'contact' покажет, где можно связаться с Хитоши",
    "kanade-phrase-2_9": "'hobby' - покажет, что вдохновляет Хитоши за пределами IDE",
    "kanade-phrase-2_10": "Если букв уже слишком много, можно ввести 'clear'",
    "kanade-phrase-2_11": "Не знаете с чего начать? 'help' выведет все команды",
    "kanade-phrase-3_1": "А вот и они! Проекты Хитоши.",
    "kanade-phrase-3_2": "Пусть их и немного, прошу ознакомтесь. Он много работал над ними",
    "kanade-phrase-4_1": "На этом всё, надеюсь вам понравилось такое небольшое приключение",
    "kanade-phrase-4_2": "Спасибо за внима..",
    "kanade-phrase-4_3": "꒰｡- ᴗ - ｡꒱ ᶻzᶻzᶻz﹒﹒",
    "itrialto-description": "Данный проект представляет собой платформу, где студенты могут выполнять IT проекты от партнеров университета или от самого университета. Кратко что здесь реализовано: регистрация/авторизация (С защитой через JWT токен), разбиение пользователей по ролям, система команд, разных бирж и проектов, взаимодействие команд и проектов и система чатов. Более подробно изучить проект можете по ссылке на GitHub или просмотрев видео.",
    "itrialto-link": "https://www.youtube.com/embed/pke4iZRQcl0",
    "urfu_ddos-link": "https://www.youtube.com/embed/p1LxfhmtztQ",
    "urfu_ddos-description": "Телеграм бот, созданный для помощи моей подруге. Целью бота является сбор информации обо всех абитуриентах, её фильтрация и сортировка, а в конце - отображение текущего места в конкурсных списках. Более детальная информация о работе бота есть на GitHub :)",
    "hitoshi.sh-description": "Вы уже находитесь в данном проекте (⌒_⌒;). В нём я делал упор на красоту дизайна, но 2D модель является его самой интересной частью. Изначально данный проект должен был быть написан на React, но у меня не получилось там подключить Live2D так, чтобы иметь полный контроль над моделью. Да и на Vue JS тоже пришлось повозиться: у меня получилось это, когда я нашел какое-то двух минутное видео на КИТАЙСКОМ (`ー´), но я съел пару 'миска рис' и всё получилось. Делать видео по этому проекта не было смысла, поэтому я предлагаю вам послушать прекрасное соло эуфониума. Композиция называется 'Звучи, эуфониум!' из аниме под таким же названием. Приятного прослушивания :)",
    "stepik-certificate-1": "src/assets/stepik-certificate-1_ru.png",
    "stepik-certificate-2": "src/assets/stepik-certificate-2_ru.png",
    "stepik-certificate-3": "src/assets/stepik-certificate-3_ru.png",
    "final-message": "Спасибо, что нашли время посмотреть мой сайт ( ´ ▽ ` ) Надеюсь, это дало вам представление обо мне. Контакты — справа, а немного достижений — ниже."
}